# Database Admin with Python

## PyMySQL and SQLAlchemy

In [4]:
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists
# Create connection string using credentials following this format
# connection = "dialect+driver://username:password@host:port/database"
connection_str = "mysql+pymysql://root:Laspc051140!!@localhost/new_db"

## Create the engine

### To make the connection between python and MySQL, you will create an engine using the connection string you just defined.

In [5]:
engine = create_engine(connection_str)

## Create a New Database

In [6]:
create_database(connection_str)

### To verify that the database was created, check with the following:

In [7]:
database_exists(connection_str)

True

## Solving Errors when running create_database for a 2nd time.

### create_database will error if the database already exists.

### To get around this, we can use an if/else statement to FIRST check if the database exists and if it DOESN'T, create it.

In [8]:
# Check if the database exists. If not, create it.
if database_exists(connection_str) == False:
  create_database(connection_str)
else:
  print('The database already exists')

The database already exists

### Now that we have created our database, we are going to add tables to it using pandas dataframes.

For this exercise, we will use this simple tshirt dataset as our dataframe.

In [9]:
import pandas as pd
df = pd.read_csv('Data/Tshirt.csv')
df.head()

  Size  Color  Cost Sold
0    S   Blue  5.00    Y
1    M    Red  7.49    Y
2    M  Green  8.00    N
3   XL  Green  4.00    N
4    L    Red  9.99    Y

### Add this table to the "practice" database. This code will name the table "tshirts."  Also, if there is already a table with that name, this code says to replace it.  You could add to an existing table by saying "if_exists = 'append' here.

In [11]:
df.to_sql('tshirts', engine, if_exists = 'replace')

9

### Now that we have converted this dataframe to a sql table, we can "communicate" with it using sql commands.

Remember that we define the sql query (typically as "q" for query). and then we read it with  pd.read_sql(q, engine).

In [12]:
q= """SELECT * FROM tshirts LIMIT 5;"""
pd.read_sql(q, engine)

   index Size  Color  Cost Sold
0      0    S   Blue  5.00    Y
1      1    M    Red  7.49    Y
2      2    M  Green  8.00    N
3      3   XL  Green  4.00    N
4      4    L    Red  9.99    Y

### You can also use the "SHOW TABLES;" query to see all of the tables that exist in our current database.

In [13]:
q= """SHOW TABLES;"""
pd.read_sql(q,engine)

  Tables_in_new_db
0          tshirts